// 8분
// 1~10까지 반복 후 i의 값이 홀수라면 "홀수"출력, 짝수라면 "짝수"출력

// 출력결과 ex)
// "홀수"
// "짝수"
// "홀수"
// "짝수"
// "홀수"
// "짝수"
// "홀수"
// "짝수"
// "홀수"
// "짝수"
// for(let i = 0; i < 10; i++){
//     let result = (i + 1) % 2 === 0 ? "짝수" : "홀수"
//     console.log(result)
// }

// for(let i = 0; i < 10; i++){
//     if((i + 1) % 2 === 0){
//         // 짝수
//         console.log("짝수")
//     }else{
//         // 홀수
//         console.log("홀수")
//     }
// }

for (let i = 0; i < 10; i++) {
    if (i === 5) {
        continue;
    }

    console.log(i);
}
